# 1η Γραπτή Εργασία Θ.Ε ΠΛΗΠΡΟ
# Filename: Lazaridou_1.py
# Υποεργασία 1
# Το πρόγραμμα υπολογίζει και επιστρέφει το άθροισμα των ακόλουθων ακεραίων:
# 9 + 99 ... + 999999999

sum = 0 # Αρχικοποίηση μεταβλητής αθροίσματος
number = 9 # Ορισμός μεταβλητής και αρχικοποίηση

for i in range(1,10): # Επαναληπτική εντολή for σε εύρος [1,10)
    sum += int(str(number) * i) # Άθροιση του αριθμού αποτελούμενου από τόσα '9' όσα υποδυκνείει ο αριθμός i
print("Το άθροισμα είναι:",sum) # Tύπωση του τελικού αθροίσματος
