# 1η Γραπτή Εργασία Θ.Ε ΠΛΗΠΡΟ
# Filename: Lazaridou_2.py
# Υποεργασία 2
# Το πρόγραμμα τυπώνει το άθροισμα το ψηφίων ενός θετικού ακέραιου αριθμού

try: # Exception Handling 
    number = int(input("Δώστε έναν θετικό ακέραιο αριθμό: ")) #Είσοδος από τον χρήστη και μετατροπή σε integer
    while number <0 : # Βρόγχος επανάληψης, εκτελείτε όσο number <0
       print("Ο αριθμός δεν ειναι θετικός,ξαναπροσπαθήστε: ")
       number = int(input("Δώστε έναν θετικό ακέραιο αριθμό: "))
except: # Αν η είσοδος δεν είναι ακέραιος αριθμός 
    print("ΣΦΑΛΜΑ! Δεν δώσατε αριθμό. Προσπαθείστε ξανά.")
    number = int(input("Δώστε έναν θετικό ακέραιο αριθμό: "))
    
          
sum = 0 #Αρχικοποίηση μεταβλητής αθροίσματος
while number != 0: # Όσο number δεν είναι 0
    sum += number % 10 # Αύξηση αθροίσματος με το υπόλοιπο της διαίρεσης 
    number //= 10 # Θέτει την μεταβλητή number ιση με το πηλίκο της ακέραιης διαίρεσης
print("Το άθροισμα είναι:",sum) 
