# 1η Γραπτή Εργασία Θ.Ε ΠΛΗΠΡΟ
# Filename:Lazaridou_3.py
# Υποεργασία 3
''' Το πρόγραμμα λαμβάνει μια συμβολοσειρά από τον χρήστη, στη συνέχεια την τυπώνει
αφού αφαιρέσει ένα χαρακτήρα που θα υποδείξει ο χρήστης και τέλος μετράει πόσες
φορές εμφανίζεται ένας χαρακτήρας, που υποδεικνύει ο χρήστης, στην αρχική συμβολοσειρά'''

my_string = input("Παρακαλώ εισάγετε μια συμβολοσειρά:") # Εισαγωγή string από χρήστη
while not my_string.isalpha(): # True: Ενόσω η my_sting δεν περιέχει μόνο γράμματα.
    print("Η συμβολοσειρά που εισάγατε είναι μη αποδεκτή!")
    my_string = input("Παρακαλώ εισάγετε μια συμβολοσειρά:")

n = int(input("Παρακαλώ εισάγετε τη θέση του προς αφαίρεση χαρακτήρα:")) #Εισαγωγή θέσης από χρήστη
while n > len(my_string): # True: Αν ο δοθείς αριθμός, είναι εκτός ορίων
    print("Ο αριθμός που εισάγετε είναι εκτός τον ορίων της συμβολοσειράς.")
    n = int(input("Παρακαλώ  εισάγετετε τη θέση του προς αφαίρεση χαρακτήρα:"))
new_string = my_string[:n-1] + my_string[n:] #Συνένωση δυο string με από slicing
print("H νέα συμβολοσειρά:",new_string)

ch = input("Παρακαλώ εισάγετε έναν χαρακτήρα:") #Εισαγωγή χαρακτήρα από χρήστη
num = my_string.count(ch) # Πόσες φορές εμφανίζεται ο ch στο my_string
print("Ο χαρακτήρας '{0}' εμφανίζεται {1} φορές στην συμβολοσειρά : {2}".format(ch,num,my_string))
per = (num*100)/len(my_string) # Υπολογισμός ποσοστού
print("Το ποσοστό των εμφανίσεων του χαρακτήρα '{0}' είναι: {1:.01f}%".format(ch,per))

end_string ="Ολοκληρώθηκε η εκτέλεση του προγράμματος"
print('\n{:^70}'.format(end_string))
